In [2]:
import pandas as pd

schools = pd.read_csv("schools.csv")
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [3]:
len(schools["school_name"].unique())

375

Which NYC schools have the best math results?

The best math results are at least 80% of the *maximum possible score of 800* for math.
Save your results in a pandas DataFrame called best_math_schools, including "school_name" and "average_math" columns, sorted by "average_math" in descending order.

In [4]:
best_math_schools = schools.loc[(schools["average_math"]>=640), ["school_name", "average_math"]].sort_values(by="average_math", ascending=False).reset_index(drop=True)
best_math_schools

                                         school_name  average_math
0                             Stuyvesant High School           754
1                       Bronx High School of Science           714
2                Staten Island Technical High School           711
3  Queens High School for the Sciences at York Co...           701
4  High School for Mathematics, Science, and Engi...           683
5                     Brooklyn Technical High School           682
6                        Townsend Harris High School           680
7  High School of American Studies at Lehman College           669
8  New Explorations into Science, Technology and ...           657
9                      Eleanor Roosevelt High School           641

What are the top 10 performing schools based on the combined SAT scores?

Save your results as a pandas DataFrame called top_10_schools containing the "school_name" and a new column named "total_SAT", with results ordered by "total_SAT" in descending order ("total_SAT" being the sum of math, reading, and writing scores).

In [5]:
top_10_schools = pd.DataFrame({"school_name": schools["school_name"],
                              "total_SAT": schools[["average_math", "average_reading","average_writing"]].sum(axis=1)}).sort_values(by="total_SAT", ascending=False).head(10).reset_index(drop= True)
top_10_schools

                                         school_name  total_SAT
0                             Stuyvesant High School       2144
1                       Bronx High School of Science       2041
2                Staten Island Technical High School       2041
3  High School of American Studies at Lehman College       2013
4                        Townsend Harris High School       1981
5  Queens High School for the Sciences at York Co...       1947
6                     Bard High School Early College       1914
7                     Brooklyn Technical High School       1896
8                      Eleanor Roosevelt High School       1889
9  High School for Mathematics, Science, and Engi...       1889

Which single borough has the largest standard deviation in the combined SAT score?

Save your results as a pandas DataFrame called largest_std_dev.
The DataFrame should contain one row, with:
"borough" - the name of the NYC borough with the largest standard deviation of "total_SAT".
"num_schools" - the number of schools in the borough.
"average_SAT" - the mean of "total_SAT".
"std_SAT" - the standard deviation of "total_SAT".
Round all numeric values to two decimal places.

In [6]:
schools["borough"].unique()

array(['Manhattan', 'Staten Island', 'Bronx', 'Queens', 'Brooklyn'],
      dtype=object)

In [7]:
schools["total_SAT"]=schools[["average_math", "average_reading","average_writing"]].sum(axis=1)
schools.head()
borough_stats = schools.groupby('borough')["total_SAT"].agg(num_schools = "count", average_SAT = "mean", std_SAT= "std").reset_index()

largest_std_dev = borough_stats.loc[borough_stats['std_SAT'].idxmax()].to_frame().T

largest_std_dev = largest_std_dev.reset_index(drop=True)
# the columns are of type object rather than numeric. A more robust way is to convert them to numeric first and then round:
largest_std_dev['average_SAT'] = pd.to_numeric(largest_std_dev['average_SAT']).round(2)
largest_std_dev['std_SAT'] = pd.to_numeric(largest_std_dev['std_SAT']).round(2)
largest_std_dev

     borough num_schools  average_SAT  std_SAT
0  Manhattan          89      1340.13   230.29